STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_audio.c
   + For each mode, you may need to implement the relative callback functions into your code.
      The Callback functions are named AUDIO_IN_XXX_CallBack() and only their prototypes are declared in
      the stm32g474e_eval_audio.h file. (refer to the example for more details on the callbacks implementations)

   + The driver API and the callback functions are at the end of the stm32g474e_eval_audio.h file.
  Known Limitations:
  ------------------
   1- If the TDM Format used to play in parallel 2 audio Streams (the first Stream is configured in codec SLOT0 and second
      Stream in SLOT1) the Pause/Resume, volume and mute feature will control both streams.
   2- Parsing of audio file is not implemented (in order to determine audio file properties: Mono/Stereo, Data size,
      File size, Audio Frequency, Audio Data header size ...). The configuration is fixed for the given audio file.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32g474e_eval_audio.h"
#include "stm32g474e_eval_bus.h"
#include "stm32g474e_eval_io.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G474E-EVAL 
  * @{
  */

/** @defgroup STM32G474E-EVAL_AUDIO STM32G474E-EVAL AUDIO
  * @brief This file includes the low layer driver for wm8994 Audio Codec
  *        available on STM32G474E-EVAL evaluation board(MB1397).
  * @{
  */


/** @defgroup STM32G474E-EVAL_AUDIO_Exported_Variables Exported Variables
  * @{
  */
/* Audio in and out component object */
void *AudioCompObj = NULL;
/* Play handle */
SAI_HandleTypeDef                      haudio_out_sai;

/* Play context */
AUDIO_OUT_Ctx_t AudioOutCtx[AUDIO_OUT_INSTANCES_NBR] = {0};

/* Recording handles */
SAI_HandleTypeDef                      haudio_in_sai;

/* Recording context */
AUDIO_IN_Ctx_t  AudioInCtx[AUDIO_IN_INSTANCES_NBR] = {0};
/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_AUDIO_Private_Variables Private Variables
  * @{
  */
/* saved pll clock config */
static RCC_OscInitTypeDef RCC_OscInitStructSaved;
static uint32_t RCC_InitSysClkSaved;
static RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStructSaved;
/* Audio in and out driver */
static AUDIO_Drv_t *AudioDrv = NULL;
/**
  * @}
  */

/** STM32G474E-EVAL_AUDIO_Private_FunctionPrototypes Private Functions
  */
#if (USE_AUDIO_CODEC_WM8994 == 1)
static int32_t WM8994_Probe(void);
#endif

/* SAI Msp config */
static void  SAI_MspInit(SAI_HandleTypeDef *hsai);
static void  SAI_MspDeInit(SAI_HandleTypeDef *hsai);

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
static void SAI_TxCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_RxCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_ErrorCallback(SAI_HandleTypeDef *hsai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
/**
  */

/** @addtogroup STM32G474E-EVAL_AUDIO_OUT_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @param  AudioInit Audio out init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{

  if(Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Fill AudioOutCtx structure */
    AudioOutCtx[Instance].Device         = AudioInit->Device;
    AudioOutCtx[Instance].SampleRate     = AudioInit->SampleRate;
    AudioOutCtx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
    AudioOutCtx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
    AudioOutCtx[Instance].Volume         = AudioInit->Volume;
    AudioOutCtx[Instance].State          = AUDIO_OUT_STATE_RESET;

    if(AudioInit->Device <= AUDIO_OUT_DEVICE_AUTO)
    {
#if (USE_AUDIO_CODEC_WM8994 == 1)
      if(WM8994_Probe() != BSP_ERROR_NONE)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
#endif
    }

    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
    if(MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
    {
      return BSP_ERROR_CLOCK_FAILURE;
    }

    /* SAI data transfer preparation:
    Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
    haudio_out_sai.Instance = AUDIO_OUT_SAIx;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
    /* Register the SAI MSP Callbacks */
    if(AudioOutCtx[Instance].IsMspCallbacksValid == 0U)
    {
      if(BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }
    }
#else
    SAI_MspInit(&haudio_out_sai);
#endif /* #if (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
    MX_SAI_InitTypeDef mx_out_config;

    /* Prepare haudio_out_sai handle */
    mx_out_config.AudioFrequency    = AudioInit->SampleRate;
    mx_out_config.AudioMode         = SAI_MODEMASTER_TX;
    mx_out_config.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
    mx_out_config.MonoStereoMode    = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
    if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_24B)
    {
      mx_out_config.DataSize          = SAI_DATASIZE_24;
      mx_out_config.FrameLength       = 64;
      mx_out_config.ActiveFrameLength = 32;
    }
    else
    {
      mx_out_config.DataSize          = SAI_DATASIZE_16;
      mx_out_config.FrameLength       = 32;
      mx_out_config.ActiveFrameLength = 16;
    }

    mx_out_config.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
    mx_out_config.Synchro           = SAI_ASYNCHRONOUS;
    mx_out_config.SynchroExt        = SAI_SYNCEXT_DISABLE;

    switch(AudioInit->Device)
    {
    case AUDIO_OUT_DEVICE_BOTH:
    case AUDIO_OUT_DEVICE_AUTO:
      mx_out_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_0123;
      break;
    case AUDIO_OUT_DEVICE_SPEAKER:
      mx_out_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_13;
      break;
    case AUDIO_OUT_DEVICE_HEADPHONE:
    default:
      mx_out_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_01;
      break;
    }

