STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_audio.c
  /* save initial RCC configuration */
  HAL_RCC_GetOscConfig(&RCC_OscInitStruct);
  /* save initial OSC configuration */
  RCC_OscInitStructSaved = RCC_OscInitStruct;
  RCC_InitSysClkSaved = (__HAL_RCC_GET_SYSCLK_SOURCE() >> RCC_CFGR_SWS_Pos);
  
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;

  /* Set the PLL configuration according to the audio frequency */
  if((SampleRate == AUDIO_FREQUENCY_11K) || (SampleRate == AUDIO_FREQUENCY_22K) || (SampleRate == AUDIO_FREQUENCY_44K) ||
     (SampleRate == AUDIO_FREQUENCY_88K) || (SampleRate == AUDIO_FREQUENCY_176K))
  {
    /* SAI1 clock config requires 11.294MHz
    SAI_CK_x = (16 MHz / PLLM) * PLLN  / PLLQ = 16 / 4 * 23 / 8 = 11.5 MHz */
    RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
    RCC_OscInitStruct.PLL.PLLN = 23;
    RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV8;
  }
  /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K or AUDIO_FREQUENCY_192K */
  else if((SampleRate == AUDIO_FREQUENCY_8K) || (SampleRate == AUDIO_FREQUENCY_16K) || (SampleRate == AUDIO_FREQUENCY_32K) ||
     (SampleRate == AUDIO_FREQUENCY_48K) || (SampleRate == AUDIO_FREQUENCY_96K) || (SampleRate == AUDIO_FREQUENCY_192K))
  {
    /* SAI1 clock config requires 49.152MHz
    SAI_CK_x = (16 MHz / PLLM) * PLLN  / PLLQ = 16 / 4 * 49 / 4 = 49 MHz */
    RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
    RCC_OscInitStruct.PLL.PLLN = 49;
    RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV4;
  }
  /* other AUDIO FREQUENCY are not supported */
  else
  {
    return HAL_ERROR;
  }
  /* in case PLL is system clock, first set system clock on HSI before
     reconfig PLL */
  if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK)
  {
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);
  }

  status = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_PLLCLK);

  if ( status == HAL_OK)
  {
     /* save all periph clock Init Struct */
     HAL_RCCEx_GetPeriphCLKConfig(&RCC_ExCLKInitStruct);
     RCC_ExCLKInitStructSaved = RCC_ExCLKInitStruct;
     /* set SAI peripheral clock */
     RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
     RCC_ExCLKInitStruct.Sai1ClockSelection   = RCC_SAI1CLKSOURCE_PLL;
     status = HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct);
  }

  return status;
}

/**
  * @brief  SAI1 clock deConfig.
  * @param  hsai SAI handle.
  * @note   The PLL configuration done within the value saved during MX_SAI1_ClockConfig
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_SAI1_ClockDeConfig(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);
  /* in case PLL is system clock, first set system clock on HSI before
     reconfig PLL */
  if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK)
  {
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);
  }
  /* restore initial pll clock config */
  (void)HAL_RCC_OscConfig(&RCC_OscInitStructSaved);
  /* restore all periph clock Init Struct*/
  (void)HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStructSaved);
  
  /* restore PLL */
  __HAL_RCC_SYSCLK_CONFIG(RCC_InitSysClkSaved);

  return HAL_OK;
}

/**
  * @brief  Initialize SAI1.
  * @param  hsai SAI handle.
  * @param  MXConfig SAI configuration structure.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_SAI1_Init(SAI_HandleTypeDef* hsai, MX_SAI_InitTypeDef *MXConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hsai->Instance == SAI1_Block_B) || (hsai->Instance == SAI1_Block_A))
  {
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(hsai);

    /* Configure SAI1_Block_ */
    hsai->Init.MonoStereoMode       = MXConfig->MonoStereoMode;
    hsai->Init.AudioFrequency       = MXConfig->AudioFrequency;
    hsai->Init.AudioMode            = MXConfig->AudioMode;
    hsai->Init.NoDivider            = SAI_MASTERDIVIDER_ENABLE;
    hsai->Init.Protocol             = SAI_FREE_PROTOCOL;
    hsai->Init.DataSize             = MXConfig->DataSize;
    hsai->Init.FirstBit             = SAI_FIRSTBIT_MSB;
    hsai->Init.ClockStrobing        = MXConfig->ClockStrobing;
    hsai->Init.Synchro              = MXConfig->Synchro;
    hsai->Init.OutputDrive          = MXConfig->OutputDrive;
    hsai->Init.FIFOThreshold        = SAI_FIFOTHRESHOLD_HF;
    hsai->Init.SynchroExt           = MXConfig->SynchroExt;
    hsai->Init.CompandingMode       = SAI_NOCOMPANDING;
    hsai->Init.TriState             = SAI_OUTPUT_NOTRELEASED;
    hsai->Init.Mckdiv               = 0U;
    hsai->Init.MckOutput            = SAI_MCK_OUTPUT_ENABLE;
    hsai->Init.MckOverSampling      = SAI_MCK_OVERSAMPLING_DISABLE;
    hsai->Init.PdmInit.Activation   = DISABLE;

    /* Configure SAI1_Block_ Frame */
    hsai->FrameInit.FrameLength       = MXConfig->FrameLength;
    hsai->FrameInit.ActiveFrameLength = MXConfig->ActiveFrameLength;
    hsai->FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai->FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
    hsai->FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;

    /* Configure SAI1_Block_ Slot */
    hsai->SlotInit.FirstBitOffset     = 0;
    if ((MXConfig->DataSize == AUDIO_RESOLUTION_24B) || (MXConfig->DataSize == AUDIO_RESOLUTION_32B))
    {
      hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_32B;
    }
    else
    {
      hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_16B;
    }
    hsai->SlotInit.SlotNumber         = 2;
    hsai->SlotInit.SlotActive         = MXConfig->SlotActive;

    if(HAL_SAI_Init(hsai) != HAL_OK)
    {
      status = HAL_ERROR;
    }
  }
  return status;
}
/**
  * @}
  */

/** @addtogroup STM32G474E-EVAL_AUDIO_IN_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio in peripherals.
  * @param  Instance Audio in instance.
  * @param  AudioInit Audio in init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Fill audio in context structure */
    AudioInCtx[Instance].Device         = AudioInit->Device;
    AudioInCtx[Instance].SampleRate     = AudioInit->SampleRate;
    AudioInCtx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
    AudioInCtx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
    AudioInCtx[Instance].Volume         = AudioInit->Volume;
    AudioInCtx[Instance].State          = AUDIO_IN_STATE_RESET;

