STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_audio.c
  if (WM8994_RegisterBusIO(&WM8994Obj, &IOCtx) != WM8994_OK)
  {
    status = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
    if (WM8994_ReadID(&WM8994Obj, &wm8994_id) != WM8994_OK)
    {
      status = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if ((wm8994_id & 0xFFFFU) != WM8994_ID)
    {
      status = BSP_ERROR_UNKNOWN_COMPONENT;
    }
    /* Reset the Codec Registers */
    else if (WM8994_Reset(&WM8994Obj) != WM8994_OK)
    {
      status = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      AudioDrv = (AUDIO_Drv_t *) &WM8994_Driver;
      AudioCompObj = &WM8994Obj;
    }
  }
  return status;
}
#endif /* USE_AUDIO_CODEC_WM8994 */

/**
  * @brief  Initialize SAI MSP.
  * @param  hsai SAI handle.
  * @retval None.
  */
static void SAI_MspInit(SAI_HandleTypeDef *hsai)
{
  static DMA_HandleTypeDef hDmaSaiTx, hDmaSaiRx;;
  GPIO_InitTypeDef         GPIO_InitStruct;

  /* Enable SAI clock */
  __HAL_RCC_SAI1_CLK_ENABLE();

   /* SAI pins configuration: FS, SCK, MCLK and SD pins */
   __HAL_RCC_GPIOE_CLK_ENABLE();
   GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull      = GPIO_NOPULL;
   GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
   GPIO_InitStruct.Alternate = GPIO_AF13_SAI1;
   GPIO_InitStruct.Pin       = GPIO_PIN_2; /* SAI1_MCLK_A */
   HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
   GPIO_InitStruct.Pin       = GPIO_PIN_4; /* SAI1_FS_A */
   HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
   __HAL_RCC_GPIOD_CLK_ENABLE();
   GPIO_InitStruct.Pin       = GPIO_PIN_6; /* SAI1_SD_A : PD6 */
   HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
   __HAL_RCC_GPIOA_CLK_ENABLE();           /* SAI1_SCK_A */
   GPIO_InitStruct.Alternate = GPIO_AF14_SAI1;
   GPIO_InitStruct.Pin       = GPIO_PIN_8;
   HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

   /* Configure the hDmaSaiTx handle parameters */
   __HAL_RCC_DMA2_CLK_ENABLE();
   __HAL_RCC_DMAMUX1_CLK_ENABLE();

   if (hsai->Instance == AUDIO_OUT_SAIx)
   {
    hDmaSaiTx.Init.Request             = DMA_REQUEST_SAI1_A;
    hDmaSaiTx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hDmaSaiTx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hDmaSaiTx.Init.MemInc              = DMA_MINC_ENABLE;
    if (AudioOutCtx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
    {
      hDmaSaiTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      hDmaSaiTx.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    }
    else /* AUDIO_RESOLUTION_24B */
    {
      hDmaSaiTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
      hDmaSaiTx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    }
    hDmaSaiTx.Init.Mode                = DMA_CIRCULAR;
    hDmaSaiTx.Init.Priority            = DMA_PRIORITY_HIGH;
    hDmaSaiTx.Instance                 = DMA2_Channel1;
    /* Associate the DMA handle */
    __HAL_LINKDMA(hsai, hdmatx, hDmaSaiTx);
    /* Deinitialize the Stream for new transfer */
    if (HAL_DMA_DeInit(&hDmaSaiTx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* Configure the DMA Stream */
    if (HAL_DMA_Init(&hDmaSaiTx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(DMA2_Channel1_IRQn, BSP_AUDIO_OUT_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(DMA2_Channel1_IRQn);
  }

   /* Audio In Msp initialization */
   if(hsai->Instance == AUDIO_IN_SAIx)
   {
    /* SAI pins configuration: SD pin */
    __HAL_RCC_GPIOE_CLK_ENABLE();
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF13_SAI1;
    GPIO_InitStruct.Pin       = GPIO_PIN_3; /* SAI1_SD_B : PE3 */
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    /* Configure the hDmaSaiRx handle parameters */
    hDmaSaiRx.Init.Request             = DMA_REQUEST_SAI1_B;
    hDmaSaiRx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hDmaSaiRx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hDmaSaiRx.Init.MemInc              = DMA_MINC_ENABLE;
    if (AudioInCtx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
    {
      hDmaSaiRx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      hDmaSaiRx.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    }
    else /* AUDIO_RESOLUTION_24B */
    {
      hDmaSaiRx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
      hDmaSaiRx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    }
    hDmaSaiRx.Init.Mode                = DMA_CIRCULAR;
    hDmaSaiRx.Init.Priority            = DMA_PRIORITY_HIGH;
    hDmaSaiRx.Instance                 = DMA2_Channel2;
    /* Associate the DMA handle */
    __HAL_LINKDMA(hsai, hdmarx, hDmaSaiRx);
    /* Deinitialize the Stream for new transfer */
    if (HAL_DMA_DeInit(&hDmaSaiRx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* Configure the DMA Stream */
    if (HAL_DMA_Init(&hDmaSaiRx) != HAL_OK)
    {
      /* Nothing to do */
    }
    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(DMA2_Channel2_IRQn, BSP_AUDIO_IN_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(DMA2_Channel2_IRQn);
  }
}

/**
  * @brief  Deinitialize SAI MSP.
  * @param  hsai SAI handle.
  * @retval None.
  */
static void SAI_MspDeInit(SAI_HandleTypeDef *hsai)
{
  if(hsai->Instance == AUDIO_OUT_SAIx)
  {
    /* Disable SAI DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(DMA2_Channel1_IRQn);

    /* Reset the DMA Stream configuration*/
    if (HAL_DMA_DeInit(hsai->hdmatx) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* Don't disable the DMA clock potentially used for other SAI block */
    /* __HAL_RCC_DMA2_CLK_DISABLE(); */
    /* __HAL_RCC_DMAMUX1_CLK_DISABLE(); */

    /* De-initialize SD pin*/
    HAL_GPIO_DeInit(GPIOE, GPIO_PIN_3);  /* SAI1_SD_B */

    /* Don't disable SAI clock potentially used for other SAI block */
    /*__HAL_RCC_SAI1_CLK_DISABLE(); */
  }

  if(hsai->Instance == AUDIO_IN_SAIx)
  {
    /* Disable SAI DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(DMA2_Channel2_IRQn);

    /* Reset the DMA Stream configuration*/
    if (HAL_DMA_DeInit(hsai->hdmarx) != HAL_OK)
    {
      /* Nothing to do */
    }

    /* Don't disable the DMA clock potentially used for other SAI block */
    /* __HAL_RCC_DMA2_CLK_DISABLE(); */
    /* __HAL_RCC_DMAMUX1_CLK_DISABLE(); */

    /* De-initialize FS, SCK, MCK and SD pins*/
    HAL_GPIO_DeInit(GPIOE, GPIO_PIN_2);  /* SAI1_MCLK_A */
    HAL_GPIO_DeInit(GPIOE, GPIO_PIN_4);  /* SAI1_FS_A */
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_8);  /* SAI1_SCK_A */
    HAL_GPIO_DeInit(GPIOD, GPIO_PIN_6);  /* SAI1_SD_A */

